#------------------------------------------------------
=head1 NAME

=head1 SYNOPSIS

=cut
#------------------------------------------------------
    use strict;
    use tranfer;
#------------------------------------------------------
# null
#------------------------------------------------------
sub null {
    my ($par)=@_;


    return $par;
}
#------------------------------------------------------
# main
#------------------------------------------------------
sub main {

   tranfer::openPort();
#   tranfer::sendData("\x01\x10\x01");
   pribor::init(0x10);

   pribor::sendData("\x01"); #Эхо-запрос

   my $data=tranfer::pribor();

   pribor::sendData("\x02"); #Синхронизация

   pribor::sendData("\x05"); #Чтение буфера событий
   my $data=tranfer::pribor();

   tranfer::closePort();

}
#------------------------------------------------------
$|++;
main(@ARGV);
